resultados/autocannon/run test.txt
C:\Users\DyA\Desktop\Coder\Clase_16\entrega16>npm test

> eje01@1.0.0 test
> node src/benchmark.js

Running 20s test @ http://localhost:8080/info
100 connections

┌─────────┬───────┬───────┬───────┬────────┬──────────┬──────────┬────────┐
│ Stat    │ 2.5%  │ 50%   │ 97.5% │ 99%    │ Avg      │ Stdev    │ Max    │
├─────────┼───────┼───────┼───────┼────────┼──────────┼──────────┼────────┤
│ Latency │ 44 ms │ 47 ms │ 94 ms │ 104 ms │ 50.73 ms │ 12.11 ms │ 139 ms │
└─────────┴───────┴───────┴───────┴────────┴──────────┴──────────┴────────┘
┌───────────┬────────┬────────┬────────┬────────┬─────────┬────────┬────────┐
│ Stat      │ 1%     │ 2.5%   │ 50%    │ 97.5%  │ Avg     │ Stdev  │ Min    │
├───────────┼────────┼────────┼────────┼────────┼─────────┼────────┼────────┤
│ Req/Sec   │ 984    │ 984    │ 2000   │ 2189   │ 1955.35 │ 258.05 │ 984    │
├───────────┼────────┼────────┼────────┼────────┼─────────┼────────┼────────┤
│ Bytes/Sec │ 441 kB │ 441 kB │ 897 kB │ 980 kB │ 876 kB  │ 115 kB │ 441 kB │
└───────────┴────────┴────────┴────────┴────────┴─────────┴────────┴────────┘

Req/Bytes counts sampled once per second.

39k requests in 20.1s, 17.5 MB read
Running 20s test @ http://localhost:8080/info/consolelog
100 connections

┌─────────┬───────┬───────┬───────┬────────┬──────────┬──────────┬────────┐
│ Stat    │ 2.5%  │ 50%   │ 97.5% │ 99%    │ Avg      │ Stdev    │ Max    │
├─────────┼───────┼───────┼───────┼────────┼──────────┼──────────┼────────┤
│ Latency │ 45 ms │ 47 ms │ 85 ms │ 108 ms │ 50.75 ms │ 12.09 ms │ 146 ms │
└─────────┴───────┴───────┴───────┴────────┴──────────┴──────────┴────────┘
┌───────────┬────────┬────────┬────────┬────────┬────────┬────────┬────────┐
│ Stat      │ 1%     │ 2.5%   │ 50%    │ 97.5%  │ Avg    │ Stdev  │ Min    │
├───────────┼────────┼────────┼────────┼────────┼────────┼────────┼────────┤
│ Req/Sec   │ 903    │ 903    │ 2009   │ 2141   │ 1954.6 │ 267.04 │ 903    │
├───────────┼────────┼────────┼────────┼────────┼────────┼────────┼────────┤
│ Bytes/Sec │ 405 kB │ 405 kB │ 900 kB │ 959 kB │ 876 kB │ 120 kB │ 405 kB │
└───────────┴────────┴────────┴────────┴────────┴────────┴────────┴────────┘

Req/Bytes counts sampled once per second.

39k requests in 20.09s, 17.5 MB read